<script setup>
import { RouterLink } from 'vue-router'
</script>

<template>
    <section id="departments" class="departments">
        <div class="container" data-aos="fade-up">

            <div class="section-title">
                <h2>درمان های دندانپزشکی</h2>
                <p>انواع مختلفی از خدمات دندانپزشکی برای حفظ سلامت دهان و دندان ها</p>
            </div>

            <div class="row" data-aos="fade-up" data-aos-delay="100">
                <div class="col-lg-4 mb-5 mb-lg-0">
                    <ul class="nav nav-tabs flex-column">
                        <li class="nav-item">
                            <RouterLink class="nav-link active show" data-bs-toggle="tab" data-bs-target="#tab-1">
                                <h4>دندانپزشک عمومی</h4>
                                <p>دندانپزشک عمومی: مراقبت از سلامت دهان و دندان های شما</p>
                            </RouterLink>
                        </li>
                        <li class="nav-item mt-2">
                            <RouterLink class="nav-link" data-bs-toggle="tab" data-bs-target="#tab-2">
                                <h4>دندانپزشک زیبایی</h4>
                                <p>دندانپزشک زیبایی: بهبود ظاهر دندان ها و لبخند شما</p>
                            </RouterLink>
                        </li>
                        <li class="nav-item mt-2">
                            <RouterLink class="nav-link" data-bs-toggle="tab" data-bs-target="#tab-3">
                                <h4>جراح لثه</h4>
                                <p>جراح لثه: درمان بیماری های لثه و بهبود سلامت دهان</p>
                            </RouterLink>
                        </li>
                        <li class="nav-item mt-2">
                            <RouterLink class="nav-link" data-bs-toggle="tab" data-bs-target="#tab-4">
                                <h4>سایر</h4>
                                <p>دندانپزشکی کودکان: حفظ سلامت دهان و دندان در کودکان</p>
                            </RouterLink>
                        </li>
                    </ul>
                </div>
                <div class="col-lg-8">
                    <div class="tab-content">
                        <div class="tab-pane active show" id="tab-1">
                            <h3>دندانپزشک عمومی</h3>
                            <p class="fst-italic">دندانپزشک عمومی: مراقبت از سلامت دهان و دندان های شما</p>
                            <img src="../assets/img/departments-1.jpg" alt="" class="img-fluid">
                            <p>دندانپزشک عمومی متخصص در مراقبت، تشخیص، و درمان مشکلات دهان و دندان ها است. این حرفه از
                                تمامی جوانب
                                سلامت دهان و دندان ها بهره می برد، از شامل ارتودنسی و جراحی دندانی تا تمیزی دندان ها و
                                روتین کارهای
                                پیشگیرانه. دندانپزشکان عمومی با برخورداری از تخصص و تجهیزات پزشکی مدرن، می توانند به شما
                                کمک کنند تا
                                سلامت دهان و دندان های خود را حفظ کرده و مشکلات دندانی و لثه ای را درمان کنید. بنابراین،
                                ملاقات با یک
                                دندانپزشک عمومی به منظور بررسی منظم و رعایت بهداشت دهان و دندان، بسیار مهم است.</p>
                        </div>
                        <div class="tab-pane" id="tab-2">
                            <h3>دندانپزشک زیبایی</h3>
                            <p class="fst-italic">دندانپزشک زیبایی: بهبود ظاهر دندان ها و لبخند شما</p>
                            <img src="../assets/img/department-2.jpg" alt="" class="img-fluid">
                            <p>دندانپزشکان زیبایی متخصص در بهبود ظاهر دندان ها و لبخند شما هستند. این حرفه شامل روش های
                                مختلفی از جمله
                                ارتودنسی، ترمیم های لثه، پوشش های دندانی و روش های سفید کردن دندان ها است. هدف این
                                دندانپزشکان، بهبود
                                ظاهر دندان ها، افزایش اعتماد به نفس و بهبود کیفیت زندگی شما است. با استفاده از تکنولوژی
                                پیشرفته و
                                تجهیزات پزشکی مدرن، دندانپزشکان زیبایی می توانند به شما کمک کنند تا دندان های شما به
                                شکلی زیبا و درخشان
                                درخشیده و شما به لبخندی جذاب دست یابید. بنابراین، اگر به دنبال بهبود ظاهر دندان های خود
                                و یک لبخند زیبا
                                هستید، ملاقات با یک دندانپزشک زیبایی می تواند انتخاب خوبی باشد.</p>
                        </div>
                        <div class="tab-pane" id="tab-3">
                            <h3>جراح لثه</h3>
                            <p class="fst-italic">جراح لثه: درمان بیماری های لثه و بهبود سلامت دهان</p>
                            <img src="../assets/img/department-3.jpg" alt="" class="img-fluid">
                            <p>جراح لثه متخصص در درمان بیماری های لثه و بهبود سلامت دهان است. بیماری های لثه اغلب به علت
                                تجمع پلاک در
                                اطراف دندان ها و روی لثه ها شروع می شوند و در صورت عدم درمان، ممکن است باعث تخریب بافت
                                های دهان و دندان
                                شوند. جراح لثه با استفاده از روش های جراحی و غیر جراحی، می تواند بیماری های لثه را درمان
                                کرده و بهبود
                                سلامت دهان را تضمین کند. روش های جراحی شامل پالپکتومی، ترمیم لثه، ترمیم بافت استخوانی، و
                                پیوند لثه است.
                                این روش ها می توانند به شما کمک کنند تا به سلامتی دهان و دندان خود برسید و از مشکلات
                                بیماری های لثه
                                جلوگیری کنید. بنابراین، در صورت داشتن هرگونه مشکل در لثه ها و دهان، ملاقات با یک جراح
                                لثه می تواند به
                                شما کمک کند تا مشکلات را بهبود بخشید و سلامت دهان خود را حفظ کنید.</p>
                        </div>
                        <div class="tab-pane" id="tab-4">
                            <h3>سایر</h3>
                            <p class="fst-italic">دندانپزشکی کودکان: حفظ سلامت دهان و دندان در کودکان</p>
                            <img src="../assets/img/department-4.jpg" alt="" class="img-fluid">
                            <p>دندانپزشکی کودکان مختص به حفظ سلامت دهان و دندان در کودکان است. در دوران کودکی، دندان ها
                                در حال رشد و
                                تکامل هستند و به همین دلیل، نیاز به مراقبت و درمان ویژه ای دارند. دندانپزشکی کودکان شامل
                                روش های مختلفی
                                مانند پیشگیری، تشخیص و درمان بیماری های دندانی و لثه ای، ترمیم دندان، ارتودنسی و جراحی
                                دهان و فک است.
                                هدف اصلی این حرفه، بهبود و حفظ سلامت دهان و دندان در کودکان است تا بتوانند در دوران
                                بزرگسالی دندان های
                                سالم و زیبا داشته باشند. دندانپزشکان کودکان با استفاده از تکنولوژی پیشرفته و روش های
                                تشخیص و درمان موثر،
                                می توانند به کودکان کمک کنند تا به سلامتی دهان و دندان خود برسند. بنابراین، در صورت
                                داشتن هرگونه مشکل در
                                دندان ها و دهان کودکان، ملاقات با یک دندانپزشک کودکان می تواند به شما کمک کند تا مشکلات
                                را بهبود بخشید و
                                سلامت دهان کودک خود را حفظ کنید.</p>
                        </div>
                    </div>
                </div>
            </div>

        </div>
    </section>
</template>

<style scoped>
@font-face {
    font-family: 'iran-sans';
    src: url(../assets/font/IRANSansX-Bold.woff) format("woff");
}

.card {
    width: 400px;
    background-color: #f5f5f5;
    border: 1px solid #ccc;
    padding: 20px;
    margin: 20px;
    font-family: 'iran-sans';
    display: inline-block;
}

.photo {
    width: 100%;
    height: auto;
    margin-bottom: 10px;
}

p {
    line-height: 25px;
    text-align: justify;
    display: flex;
}
</style>